{
  "title": "Digital Transformation, the Sentient Web and Cognitive Agents",
  "proposer": {
    "login": "dsr",
    "name": "Dave Raggett",
    "email": "dsr@w3.org"
  },
  "summary": "Framing the aims and challenges for the Digital Transformation of industry, the emergence of the Sentient Web and new approaches to <a href='https://www.w3.org/Data/demos/chunks/chunks.html'>cognitive agents</a> based upon decades of progress in Cognitive Psychology that pave the way for a new paradigm for AI, focusing on human oriented computing. <a href='https://www.w3.org/Data/events/tpac2019/digital-transformation.pdf'>slides</a>",
  "type": "Talk with discussion and demos",
  "goals": "Introduce the W3C to opportunities for addressing Digital Transformation with graph data and rules, together with highly scalable graph algorithms and AI/ML",
  "capacity": "medium",
  "report": "<p>This session focused on digital transformation as the adoption by organisations of advanced digital technologies as a means to achieve increased efficiency, improved flexibility and greater speed at adapting to changes in business conditions. This emphasises the strategic importance of data and the need for enterprise-wide data management and governance. The business challenges for digital transformation include the need to capture knowledge about information and processes in a machine interpretable form, and to bring people along rather than to impose solutions from above.</p><p>From a technical perspective, the integration of information services across organisations is greatly eased with the use of graph models for concepts and relationships. The second part of breakout looked at ideas for simplifying the use of graphs for the average developer, and the increasing importance of machine learning to address scaling issues. Experimental work was presented for an approach based upon decades of progress in Cognitive Psychology that embraces both RDF and Property Graphs. This seeks to build upon the latest models of how the human brain works, and the analogies with Web architecture. Help is sought for gathering use cases and data sets as a basis for driving further progress.</p><p>Some links: <a href='https://www.w3.org/Data/events/tpac2019/digital-transformation.pdf'>https://www.w3.org/Data/events/tpac2019/digital-transformation.pdf</a> <a href='https://www.w3.org/Data/demos/chunks/chunks.html'>https://www.w3.org/Data/demos/chunks/chunks.html</a>"
}
