{
  "title": "Efficient audio/video processing",
  "proposer": [
    {
      "login": "fd",
      "name": "Francois Daoust",
      "email": "fd@w3.org"
    },
    {
      "login": "dom",
      "name": "Dominique Hazael-Massieux",
      "email": "dom@w3.org"
    }
  ],
  "summary": "W3C groups (e.g. WebRTC WG, Machine Learning for the Web CG, Audio WG, Media WG, Immersive Web WG) discuss, develop and/or dream about ways to process audio/video streams efficiently. Use cases include barcode reading, face/gesture tracking, emotion analysis, funny hats, background removal or blurring, augmented reality, video overlays, voice effects, or custom codecs. Would it be useful and possible to develop a common mechanism that different APIs could leverage to hook together with streams of media while avoiding useless memory copies? What could such a mechanism look like? ",
  "type": "open discussion",
  "goals": ["Look at use cases and at how they can be implemented today", "assess possible performance gains if they were implemented with a more efficient mechanism", "refine scope for possible work on the topic", "review the Insertable Media Streams extension to WebRTC PeerConnections proposal + WebCodecs to allow inline media modification", "gauge interest among parties."],
  "others": ["riju", "joconnor","pthatcher","padenot", "halvestr"],
  "capacity": "medium",
  "track": "media",
  "report": "<p>After a <a href='https://www.w3.org/2019/Talks/TPAC/efficient-media-processing/'>short introduction</a> to set the context, the group reviewed <a href='https://docs.google.com/presentation/d/1kM5JWiaa8HjDthzHHowLOHPBhp3FLX-dXvSkq6-jXIg/mobilepresent?slide=id.g604f5f2509_0_5'>current performance of media capture use cases</a> and reflected on experience gained on similar topics in Web Audio and Firefox OS project.</p><p>The <a href='https://github.com/wicg/web-codecs'>WebCodecs</a> proposal, coupled with hooks to it in dedicated APIs as proposed in the <a href='http://www.w3.org/2019/09/18-mediaprocessing-harald-insertable-media-processing.pdf'>Insertable Media Processing proposal</a>, was hinted as a possible solution in that space, even though WebCodecs does not currently aim at solving raw media processing scenarios for now. More thoughts should be thrown into designing a generic architecture for media processing. There was interest to continue discussions, possibly in the Media &amp; Entertainment Interest Group or in a Community Group.</p>"
}
