{
  "title": "A new approach to large DOM and virtual scrollers using rendersubtree",
  "proposer": {
    "login": "fergal",
    "name": "Fergal Daly",
    "email": "fergal@chromium.org"
  },
  "summary": "Describe our work on using <a href='https://github.com/WICG/display-locking'>display locking/rendersubtree</a> to prototype the <a href='https://github.com/WICG/virtual-scroller'>virtual-scroller custom element</a> that allows large amounts of content to be present in the DOM without causing performance problems (the name may change since it's not actually JSON-DOM virtualization). This is in contrast to traditional virtualization which achieves performance by keeping most of the content outside of the DOM. By keeping content in the DOM, we retain accessibility, indexability and in-page find.",
  "type": "talk & discussion",
  "goals": "Raise awareness and start discussion about this problem and solution. Demonstrate a use of rendersubtree.",
  "others": ["chrishtr", "ddenicol", "rakina", "vmpstr"],
  "capacity": "medium",
  "track": "core",
  "report": "<p> The talk covered the proposed <a href='https://github.com/WICG/display-locking/'>rendersubtree</a> attribute and how to use it to make large sections of DOM perform well without virtualization. The <a href='https://bit.ly/2m5JMtN'>presentation</a> (including videos for all demos) and <a href='https://www.w3.org/2019/09/18-virtual-scroller-minutes.html'>IRC minutes</a> are available. There were a lot of questions and clarifications on the details of rendersubtree. </p> <p> Things not captured by the spec/explainer or the presentation included: </p><ul>  <li>performance vs accuracy is a tradeoff, e.g. scroll-bar size and tick-marks for CTRL-f cannot be perfect. When you defer style and layout all you have are estimated sizes <li>selections's interaction with content is tricky and still in <a href='https://github.com/WICG/display-locking/issues/57'>flux</a> - should hidden content be included in selections (and automatically unhidden)? This may be use-case dependent <li>should scrolling cause content hidden with rendersubtree to be revealed (outside of a virtual-scroller context)? <a href='https://github.com/WICG/display-locking/issues/79'>Further discussion</a>. <li>rendersubtree is a proposed standard, virtual-scroller is not <li>the 11MB single-page HTML standard can scroll and resize at <a href='https://docs.google.com/presentation/d/1zEso2AeLlXdtDrYDcovG8bBXKFKqb7500Hw8ZuWAsyo/edit#slide=id.g6026c12ba4_2_110'>30FPS</a> with the help of rendersubtree.</li></ul>"
}
