{
  "title": "Voice assistants - opportunities for standardization?",
  "proposer": {
    "login": "philarcher",
    "name": "Phil Archer",
    "email": "phil.archer@gs1.org"
  },
  "summary": "Voice assistants present exciting new methods to interact with the Web but how can/should we develop standards that benefit all stake holders from start ups to tech giants?",
  "type": "Discussion",
  "goals": "To identify parties most interested in the generic area of voice interaction and to narrow that down to a set of more specific areas of interest. E-commerce? Fact checking? Media streaming? APIs for Skills? More ...",
  "others": ["mhakkine", "lwaston"],
  "capacity": "small",
  "report": "<p>Roughly 20 people gathered for this lively session that began with a <a href='https://docs.google.com/presentation/d/1HWaE_u9084sDdHJShcKANQcPn6PUV7I5ss8fJpLz4_Y/edit#'>short introductory set of slides</a>, including a video from MIT's Auto-Id lab concerning the proposed <a href='https://openvoicenetwork.org/'>Open Voice Network</a>. After further introductory remarks, highlighting a variety of use cases and interests, there was an active discussion. The session was attended by staff from both Microsoft and Google who were close to, but not directly involved in, work on Cortana and Google Home.</p><p>The conclusions were:</p><ol><li>It seems likely that there would be sufficient interest in extending <a href='https://www.w3.org/TR/speech-synthesis/'>SSML, version 1.1 of which became a Rec in 2010</a>. <li>It further seems likely that there would be interest in defining additional hooks for Web pages to aid voice-driven navigation - things like 'add to basket' or other such common functions. These would almostcertainly be defined as schema.org terms.</li><li>The voice assistant platforms include a lot of proprietary technologies that are very unlikely to be standardised.</li><li>There was good agreement around the room that a W3C workshop would be well worth exploring. There were several offers to host such an event.</li></ol>"
}
